I. Préparation des Données

In [1]:
import pandas as pd;
import numpy as np;

In [2]:
df_shops = pd.read_csv('shops.csv')
df_items = pd.read_csv('items.csv')
df_item_categories = pd.read_csv('item_categories.csv')
df_sample_submission = pd.read_csv('sample_submission.csv')
df_sales_train = pd.read_csv('sales_train.csv')
df_test = pd.read_csv('test.csv')

Exploration des données

Analyse des fichiers shops.csv

In [8]:
df_shops.head()

                        shop_name  shop_id
0   !Якутск Орджоникидзе, 56 фран        0
1   !Якутск ТЦ "Центральный" фран        1
2                Адыгея ТЦ "Мега"        2
3  Балашиха ТРК "Октябрь-Киномир"        3
4        Волжский ТЦ "Волга Молл"        4

In [9]:
df_shops.describe()

         shop_id
count  60.000000
mean   29.500000
std    17.464249
min     0.000000
25%    14.750000
50%    29.500000
75%    44.250000
max    59.000000

In [10]:
df_shops.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 60 entries, 0 to 59
Data columns (total 2 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   shop_name  60 non-null     object
 1   shop_id    60 non-null     int64
dtypes: int64(1), object(1)
memory usage: 1.1+ KB

Analyse des fichiers items.csv

In [11]:
df_items.head()

,item_name,item_id,item_category_id
0,! ВО ВЛАСТИ НАВАЖДЕНИЯ (ПЛАСТ.) D,0,40
1,!ABBYY FineReader 12 Professional Edition Full...,1,76
2,***В ЛУЧАХ СЛАВЫ (UNV) D,2,40
3,***ГОЛУБАЯ ВОЛНА (Univ) D,3,40
4,***КОРОБКА (СТЕКЛО) D,4,40

In [12]:
df_items.describe()

           item_id  item_category_id
count  22170.00000      22170.000000
mean   11084.50000         46.290753
std     6400.07207         15.941486
min        0.00000          0.000000
25%     5542.25000         37.000000
50%    11084.50000         40.000000
75%    16626.75000         58.000000
max    22169.00000         83.000000

In [13]:
df_items.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 22170 entries, 0 to 22169
Data columns (total 3 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   item_name         22170 non-null  object
 1   item_id           22170 non-null  int64
 2   item_category_id  22170 non-null  int64
dtypes: int64(2), object(1)
memory usage: 519.7+ KB

Analyse des fichiers item_categories.csv

In [14]:
df_item_categories.head()

        item_category_name  item_category_id
0  PC - Гарнитуры/Наушники                 0
1         Аксессуары - PS2                 1
2         Аксессуары - PS3                 2
3         Аксессуары - PS4                 3
4         Аксессуары - PSP                 4

In [15]:
df_item_categories.describe()

       item_category_id
count         84.000000
mean          41.500000
std           24.392622
min            0.000000
25%           20.750000
50%           41.500000
75%           62.250000
max           83.000000

In [16]:
df_item_categories.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 84 entries, 0 to 83
Data columns (total 2 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   item_category_name  84 non-null     object
 1   item_category_id    84 non-null     int64
dtypes: int64(1), object(1)
memory usage: 1.4+ KB

Analyse des fichiers sample_submission.csv

In [17]:
df_sample_submission.head()

   ID  item_cnt_month
0   0             0.5
1   1             0.5
2   2             0.5
3   3             0.5
4   4             0.5

In [18]:
df_sample_submission.describe()

                  ID  item_cnt_month
count  214200.000000        214200.0
mean   107099.500000             0.5
std     61834.358168             0.0
min         0.000000             0.5
25%     53549.750000             0.5
50%    107099.500000             0.5
75%    160649.250000             0.5
max    214199.000000             0.5

In [19]:
df_sample_submission.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 214200 entries, 0 to 214199
Data columns (total 2 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   ID              214200 non-null  int64
 1   item_cnt_month  214200 non-null  float64
dtypes: float64(1), int64(1)
memory usage: 3.3 MB

Analyse des fichiers sales_train.csv

In [20]:
df_sales_train.head()

         date  date_block_num  shop_id  item_id  item_price  item_cnt_day
0  02.01.2013               0       59    22154      999.00           1.0
1  03.01.2013               0       25     2552      899.00           1.0
2  05.01.2013               0       25     2552      899.00          -1.0
3  06.01.2013               0       25     2554     1709.05           1.0
4  15.01.2013               0       25     2555     1099.00           1.0

In [21]:
df_sales_train.describe()

       date_block_num       shop_id       item_id    item_price  item_cnt_day
count    2.935849e+06  2.935849e+06  2.935849e+06  2.935849e+06  2.935849e+06
mean     1.456991e+01  3.300173e+01  1.019723e+04  8.908532e+02  1.242641e+00
std      9.422988e+00  1.622697e+01  6.324297e+03  1.729800e+03  2.618834e+00
min      0.000000e+00  0.000000e+00  0.000000e+00 -1.000000e+00 -2.200000e+01
25%      7.000000e+00  2.200000e+01  4.476000e+03  2.490000e+02  1.000000e+00
50%      1.400000e+01  3.100000e+01  9.343000e+03  3.990000e+02  1.000000e+00
75%      2.300000e+01  4.700000e+01  1.568400e+04  9.990000e+02  1.000000e+00
max      3.300000e+01  5.900000e+01  2.216900e+04  3.079800e+05  2.169000e+03

In [22]:
df_sales_train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2935849 entries, 0 to 2935848
Data columns (total 6 columns):
 #   Column          Dtype
---  ------          -----
 0   date            object
 1   date_block_num  int64
 2   shop_id         int64
 3   item_id         int64
 4   item_price      float64
 5   item_cnt_day    float64
dtypes: float64(2), int64(3), object(1)
memory usage: 134.4+ MB

Analyse des fichiers test.csv

In [23]:
df_test.head()

   ID  shop_id  item_id
0   0        5     5037
1   1        5     5320
2   2        5     5233
3   3        5     5232
4   4        5     5268

In [24]:
df_test.describe()

                  ID        shop_id        item_id
count  214200.000000  214200.000000  214200.000000
mean   107099.500000      31.642857   11019.398627
std     61834.358168      17.561933    6252.644590
min         0.000000       2.000000      30.000000
25%     53549.750000      16.000000    5381.500000
50%    107099.500000      34.500000   11203.000000
75%    160649.250000      47.000000   16071.500000
max    214199.000000      59.000000   22167.000000

In [25]:
df_test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 214200 entries, 0 to 214199
Data columns (total 3 columns):
 #   Column   Non-Null Count   Dtype
---  ------   --------------   -----
 0   ID       214200 non-null  int64
 1   shop_id  214200 non-null  int64
 2   item_id  214200 non-null  int64
dtypes: int64(3)
memory usage: 4.9 MB

2. Nettoyage des données

In [26]:
df_shops.isnull().sum()

shop_name    0
shop_id      0
dtype: int64

In [27]:
df_items.isnull().sum()

item_name           0
item_id             0
item_category_id    0
dtype: int64

In [28]:
df_item_categories.isnull().sum()

item_category_name    0
item_category_id      0
dtype: int64

In [29]:
df_sample_submission.isnull().sum()

ID                0
item_cnt_month    0
dtype: int64

In [30]:
df_sales_train.isnull().sum()

date              0
date_block_num    0
shop_id           0
item_id           0
item_price        0
item_cnt_day      0
dtype: int64

In [31]:
df_test.isnull().sum()

ID         0
shop_id    0
item_id    0
dtype: int64

In [32]:
# Extraction des informations de date (année, mois, jour)
df_sales_train['date'].dtype
df_sales_train['date'] = pd.to_datetime(df_sales_train['date'], format='%d.%m.%Y')
df_sales_train['year'] = df_sales_train['date'].dt.year
df_sales_train['month'] = df_sales_train['date'].dt.month
df_sales_train['day'] = df_sales_train['date'].dt.day

In [33]:
# Création d'une caractéristique dérivée : ventes mensuelles cumulées par magasin et produit
df_sales_train['vente_mensuel'] = df_sales_train.groupby(['shop_id', 'item_id', 'month'])['item_cnt_day'].transform('sum')

In [34]:
# Création d'une caractéristique : prix moyen par produit
df_sales_train['prix_moyen_prod'] = df_sales_train.groupby('item_id')['item_price'].transform('mean')

In [35]:
df_sales_train

,date,date_block_num,shop_id,item_id,item_price,item_cnt_day,year,month,day,vente_mensuel,prix_moyen_prod
0,2013-01-02,0,59,22154,999.00,1.0,2013,1,2,1.0,702.932203
1,2013-01-03,0,25,2552,899.00,1.0,2013,1,3,0.0,937.888889
2,2013-01-05,0,25,2552,899.00,-1.0,2013,1,5,0.0,937.888889
3,2013-01-06,0,25,2554,1709.05,1.0,2013,1,6,1.0,1709.050000
4,2013-01-15,0,25,2555,1099.00,1.0,2013,1,15,1.0,1123.101786
...,...,...,...,...,...,...,...,...,...,...,...
2935844,2015-10-10,33,25,7409,299.00,1.0,2015,10,10,3.0,295.482353
2935845,2015-10-09,33,25,7460,299.00,1.0,2015,10,9,3.0,294.299322
2935846,2015-10-14,33,25,7459,349.00,1.0,2015,10,14,1.0,303.724153
2935847,2015-10-22,33,25,7440,299.00,1.0,2015,10,22,1.0,291.652174
2935848,2015-10-03,33,25,7460,299.00,1.0,2015,10,3,3.0,294.299322

Stockage des données

Importation des données nettoyées dans PostgreSQL

In [36]:
import psycopg2
from psycopg2 import errors

# Connexion à la base de données 'postgres'
conn = psycopg2.connect(
    dbname="postgres",
    user="postgres",
    password="W@nkebosua11",  
    host="localhost",
    port="5432"
)

# Ouvrir un curseur pour exécuter des commandes SQL
conn.autocommit = True  
cursor = conn.cursor()

# Tentative de création de la nouvelle base de données 'Vente_db'
try:
    cursor.execute("CREATE DATABASE Vente_db")
    print("Base de données 'Vente_db' créée avec succès !")
except errors.DuplicateDatabase:
    # Si la base de données existe déjà, afficher un message approprié
    print("La base de données 'Vente_db' existe déjà.")


# Fermer le curseur et la connexion
cursor.close()
conn.close()

La base de données 'Vente_db' existe déjà.

In [37]:
from sqlalchemy import create_engine

# Connexion à la nouvelle base de données 'Vente_db'
engine = create_engine('postgresql://postgres:W%40nkebosua11@localhost:5432/vente_db?client_encoding=utf8')

# Test de connexion
connection = engine.connect()
print("Connexion réussie à la base de données 'Vente_db' !")

Connexion réussie à la base de données 'Vente_db' !

In [38]:
# Export des données préparées dans une table PostgreSQL
df_sales_train.to_sql('sales_train', engine, if_exists='replace', index=False, chunksize=1000)
df_shops.to_sql('shops', engine, if_exists='replace', index=False, chunksize=1000)
df_items.to_sql('items', engine, if_exists='replace', index=False, chunksize=1000)
df_item_categories.to_sql('item_categories', engine, if_exists='replace', index=False, chunksize=1000)
df_sample_submission.to_sql('sample_submission', engine, if_exists='replace', index=False, chunksize=1000)
print("\nLes données ont été nettoyées, transformées et stockées dans PostgreSQL avec succès.")

Les données ont été nettoyées, transformées et stockées dans PostgreSQL avec succès.

2. Modélisation

In [39]:
df_sales_train.head()

,date,date_block_num,shop_id,item_id,item_price,item_cnt_day,year,month,day,vente_mensuel,prix_moyen_prod
0,2013-01-02,0,59,22154,999.00,1.0,2013,1,2,1.0,702.932203
1,2013-01-03,0,25,2552,899.00,1.0,2013,1,3,0.0,937.888889
2,2013-01-05,0,25,2552,899.00,-1.0,2013,1,5,0.0,937.888889
3,2013-01-06,0,25,2554,1709.05,1.0,2013,1,6,1.0,1709.050000
4,2013-01-15,0,25,2555,1099.00,1.0,2013,1,15,1.0,1123.101786

In [40]:
# Agrégation des ventes mensuelles
df_vente_mensuelle = df_sales_train.groupby(['date_block_num', 'shop_id', 'item_id']).agg({
    'item_cnt_day': 'sum',
    'item_price': 'mean'
}).reset_index()

In [41]:
# Renommer la colonne pour vente mensuelle
df_vente_mensuelle.rename(columns={'item_cnt_day': 'vente_mensuelle'}, inplace=True)
df_vente_mensuelle.head()

   date_block_num  shop_id  item_id  vente_mensuelle  item_price
0               0        0       32              6.0       221.0
1               0        0       33              3.0       347.0
2               0        0       35              1.0       247.0
3               0        0       43              1.0       221.0
4               0        0       51              2.0       128.5

In [42]:
import xgboost as xgb
from sklearn.model_selection import train_test_split

# Préparation des features et de la variable cible
X = df_vente_mensuelle[['date_block_num', 'shop_id', 'item_id', 'item_price']]
y = df_vente_mensuelle['vente_mensuelle']

# Séparation en données d'entraînement et de test
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2, random_state=42)

# Instanciation du modèle XGBoost
model = xgb.XGBRegressor(objective='reg:squarederror', n_estimators=100, max_depth=6)

# Entraînement du modèle
model.fit(X_train, y_train)

# Prédictions
y_pred = model.predict(X_test)

In [43]:
from sklearn.metrics import mean_squared_error, mean_absolute_error, r2_score
import numpy as np

# Calcul du RMSE et MAE et R²
rmse = np.sqrt(mean_squared_error(y_test, y_pred))
mae = mean_absolute_error(y_test, y_pred)
r2 = r2_score(y_test, y_pred)

print(f"RMSE: {rmse}, MAE: {mae}, R²: {r2}")

RMSE: 5.580757509010832, MAE: 1.394119013535731, R²: 0.5261950605537791

In [72]:
"""
RMSE et MAE montrent que les erreurs du modèle sont raisonnables, bien que le RMSE indique que certaines erreurs sont relativement élevées. 
Cela peut être acceptable si les valeurs des ventes sont assez élevées.
R² à 0.5261 montre que ton modèle explique environ la moitié de la variance des ventes, ce qui est un bon point de départ, mais il est possible d'améliorer encore le modèle.
"""

"\nRMSE et MAE montrent que les erreurs du modèle sont raisonnables, bien que le RMSE indique que certaines erreurs sont relativement élevées. \nCela peut être acceptable si les valeurs des ventes sont assez élevées.\nR² à 0.5261 montre que ton modèle explique environ la moitié de la variance des ventes, ce qui est un bon point de départ, mais il est possible d'améliorer encore le modèle.\n"

In [73]:
import pickle

# Sauvegarder le modèle dans un fichier pickle
with open('model_vente_mensuelle.pkl', 'wb') as f:
    pickle.dump(model, f)

print("Modèle sauvegardé avec succès.")

Modèle sauvegardé avec succès.